{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.85}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_4", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "activation": "relu", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.85}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "activation": "relu", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_6", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 4, "activation": "softmax", "use_bias": true, "activity_regularizer": null}}]}